#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

        }
    }

  # module.KEYCLOAK_PROD.module.moh_applications.module.HSPP.module.client-roles.keycloak_role.ROLES["HSPP_Restricted_DART"] has changed
  ~ resource "keycloak_role" "ROLES" {
      + attributes = {}
        id         = "74cdab97-b920-45b7-971a-1da5263bdd78"
        name       = "HSPP_Restricted_DART"
        # (2 unchanged attributes hidden)
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.HSPP.module.client-roles.keycloak_role.ROLES["HSPP_Restricted_DART"] has changed
  ~ resource "keycloak_role" "ROLES" {
      + attributes = {}
        id         = "c0e205c5-a2e2-459c-9844-9ff776c55ca9"
        name       = "HSPP_Restricted_DART"
        # (2 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.KEYCLOAK_DEV.module.moh_applications.module.USER-MANAGEMENT.keycloak_openid_client.CLIENT will be updated in-place
  ~ resource "keycloak_openid_client" "CLIENT" {
        id                                         = "0ac8e30e-28cb-4545-bd7f-dc4a195661b2"
      - login_theme                                = "moh-app-realm-idp-restriction" -> null
        name                                       = "MoH User Management"
        # (25 unchanged attributes hidden)

      - authentication_flow_binding_overrides {
          - browser_id = "9caca0f9-1c0c-4def-85c6-637d1c8a4d24" -> null
        }
    }

  # module.KEYCLOAK_DEV.module.moh_citizen.module.EMACCS.module.payara-client.keycloak_openid_client.CLIENT will be created
  + resource "keycloak_openid_client" "CLIENT" {
      + access_type                               = "CONFIDENTIAL"
      + backchannel_logout_session_required       = false
      + client_authenticator_type                 = "client-secret"
      + client_id                                 = "EMACCS"
      + client_secret                             = (sensitive value)
      + consent_required                          = false
      + description                               = "Emergency Medical Assistant Continuing Competency System"
      + direct_access_grants_enabled              = false
      + display_on_consent_screen                 = false
      + enabled                                   = true
      + exclude_session_state_from_auth_response  = false
      + frontchannel_logout_enabled               = false
      + full_scope_allowed                        = false
      + id                                        = (known after apply)
      + implicit_flow_enabled                     = false
      + name                                      = "EMACCS"
      + oauth2_device_authorization_grant_enabled = false
      + realm_id                                  = "moh_applications"
      + resource_server_id                        = (known after apply)
      + service_account_user_id                   = (known after apply)
      + service_accounts_enabled                  = true
      + standard_flow_enabled                     = true
      + use_refresh_tokens                        = false
      + use_refresh_tokens_client_credentials     = false
      + valid_redirect_uris                       = [
          + "http://localhost:8080/*",
          + "https://emaccsd.hlth.gov.bc.ca/*",
          + "https://logontest7.gov.bc.ca/clp-cgi/logoff.cgi*",
        ]
    }

  # module.KEYCLOAK_DEV.module.moh_citizen.module.EMACCS.module.payara-client.keycloak_openid_user_client_role_protocol_mapper.client_role_mapper will be created
  + resource "keycloak_openid_user_client_role_protocol_mapper" "client_role_mapper" {
      + add_to_access_token         = true
      + add_to_id_token             = false
      + add_to_userinfo             = false
      + claim_name                  = "EMACCS_role_not_used"
      + claim_value_type            = "String"
      + client_id                   = (known after apply)
      + client_id_for_role_mappings = "EMACCS"
      + id                          = (known after apply)
      + multivalued                 = true
      + name                        = "EMACCS Role - Not Used"
      + realm_id                    = "moh_applications"
    }

Plan: 2 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pushed by: @sharpedavid, Action: `pull_request`*